{
  "publications": [
    {
      "item": "Roy, D.K., Goswami, S., Saha, A., Mallik, S., Rahman, S.A., Rafiq, M.R., Hasan, I., 2024. Assessing Coastal Groundwater Quality: Implications of Climate Change in Rangabali Upazila, Patuakhali, Bangladesh. Barishal University Journal of Science and Engineering, Vol. 9: 255-276 (June 2024), ISSN 2411-247X. "
    },
    {
      "item": "Mallik, S., Goswami, S., Roy, D.K., Hossain, M.J., Jahan, A., Saha, A. and Islam, A.R.M.T., 2024. Assessment of groundwater resources through hydrogeochemical investigation and multivariate chemometric statistics in Bagerhat district, Bangladesh. Solid Earth Sciences, 9(3), p.100200. "
    },
    {
      "item": "Rahim, M.A., Akter, N., Roy, D.K., Hasan, I., Salman, M.A., Goswami, S., Abir, T.M., Biswas, R.K. and Rakib, M.M.H., 2024. Assessment of Socio-Economic Impacts of River Bank Erosion: Enhancing Resilience in the Coastal Belt of Bangladesh. The Journal of Environment & Development, p.10704965241246710."
    },
    {
      "item": "Saha, A., Roy, D.K., Khan, R., Ornee, T.I., Goswami, S., Idris, A.M., Biswas, P.K. and Tamim, U., 2023. Provenance, weathering, climate and tectonic setting of Padma River sediments, Bangladesh: A geochemical approach. CATENA, 233, p.107485."
    },
    {
      "item": "Goswami, S., Rahman, S.A., Alam, M.M.T., Rahman, M., Rafiq, M.R., Jaman, M.H. and Roy, D.K., 2022. Assessment of Shoreline Changes and the Groundwater Quality along the Coast of Kuakata, Patuakhali, Bangladesh. Journal of Ecological Engineering, 23(7), pp.323-332."
    },
    {
      "item": "Simu, A.,S., Roy, M.,K., Saha, A., Ornee, T.,I., Biswas, R., K., Goswami, S. and Roy, D.,K., 2023.Geotechnical Characterization of Dupi Tila Formation, Sitapahar Anticline, Kaptai, Rangamati, Bangladesh: Implication for Tectonic Setting, Weathering, Climate and Provenance (Accepted). Barishal University Journal. ISSN 2411-247X."
    },
    {
      "item": "Jaman, H.M., Arafat, Y.M., Islam, S.M., Ahmmed H.M., Goswami, S. (2020). Morpho-dynamics of River Bank and Population Migration along Bhairab, Rupsha and Majutkhali rivers in Dighalia Upazila, Khulna, Bangladesh. Barishal University Journal of Science and Engineering, 7(1): 11-25 (2020). ISSN 2411-247X."
    },
    {
      "item": "Goswami, S., Rahman, M.A.K.M., Fuad, M.I.M., Roy, D.K., Rahim, M.A. (2017). Groundwater quality assessment of Barisal City Corporation in Bangladesh. Barisal University Journal Part 1, 4(2):339-350 (2017), ISSN 2411-247X."
    },
    {
      "item": "Roy, D.K., Goswami, S., Ahmed, T., Saha, M.K., Emon, M.H., Rahim, M.A. (2017). Socio-economic impacts of river bank erosion on Durgapasha union in Bakerganj Upazila, Bangladesh. Barisal University Journal Part 1, 4(1):165-183 (2017), ISSN 2411-247X."
    },
    {
      "item": "Roy, D.K., Rahim, M.A., Roy, U., Goswami, S., Zaman, M.A.K.M., Purevjav, N. (2017). Assessment of Groundwater quality and associated hazard identification in the Betagi. Barisal University Journal Part 1, 4(2):361-376 (2017), ISSN 2411-247X."
    }
  ]
}
